redd82/HaptiCap_V2_ESP32/src/main.cpp
// Loads the calibration data from a file
void IRAM_ATTR loadCalibrationData(fs::FS &fs, const char * path, CalData &caldata) {
  Serial.println(F("Loading calibration data..."));
  File file = fs.open(path, FILE_READ);
  delay(10);
  DeserializationError error = deserializeJson(calDataDoc, file);

  if (error){
    Serial.println(F("Failed to read file, using default calibration data."));
    Serial.println(error.c_str());
    saveCalibrationData(SPIFFS, path, caldata);
  }else{
  putJSONCalibrationDataInMemory();
  file.close();
  }
}

 void saveDebugSettingsToJSON() {
  debugSettingsDoc["debugHaptic"] = debugSettings.debugHaptic;
  debugSettingsDoc["debug2Serial"] = debugSettings.debug2Serial;
  debugSettingsDoc["debugData2Serial"] = debugSettings.debugData2Serial;  
  debugSettingsDoc["debug2Telnet"] = debugSettings.debug2Telnet;
}

// Saves the configuration to a file
void saveDebugSettings(fs::FS &fs, const char * path, const DebugSettings &debugSettings) {
  deleteFile(SPIFFS, path);
  Serial.println(path);
  File file = fs.open(path, FILE_WRITE);
  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }
  saveDebugSettingsToJSON();
  if (serializeJson(debugSettingsDoc, file) == 0) {
    Serial.println(F("Failed to write to file"));
  }else{
    Serial.println(F("New file written"));
  }
  file.close();
}

void putJSONDebugSettingsInMemory() {
  debugSettings.debugHaptic = debugSettingsDoc["debugHaptic"].as<int>();  
  debugSettings.debug2Serial = debugSettingsDoc["debug2Serial"].as<int>();
  debugSettings.debugData2Serial = debugSettingsDoc["debugData2Serial"].as<int>(); 
  debugSettings.debug2Telnet = debugSettingsDoc["debug2Telnet"].as<int>(); 
}

// Loads the debug settings from a file
void IRAM_ATTR loadDebugSettings(fs::FS &fs, const char * path, DebugSettings &debugSettings) {
  Serial.println(F("Loading debug settings..."));
  File file = fs.open(path, FILE_READ);
  delay(10);
  DeserializationError error = deserializeJson(debugSettingsDoc, file);

  if (error){
    Serial.println(F("Failed to read file, using default debug settings."));
    Serial.println(error.c_str());
    saveDebugSettings(SPIFFS, path, debugSettings);
  }else{
  putJSONDebugSettingsInMemory();
  file.close();
  }
}

 void saveSensorDataToJSON() {
  SensorDataDoc["sensor"] = "gps";
  SensorDataDoc["time"] = sensorData.gpsTime;
  SensorDataDoc["ownLat"] = sensorData.ownLat;  
  SensorDataDoc["ownLon"] = sensorData.ownLon;
  SensorDataDoc["homeBaseLat"] = sensorData.homeBaseLat;
  SensorDataDoc["homeBaseLon"] = sensorData.homeBaseLon;
  SensorDataDoc["homeBaseBearing"] = sensorData.homeBaseBearing;
  SensorDataDoc["homeBaseDirection"] = sensorData.homeBaseDirection;
  SensorDataDoc["homeBaseDistance"] = sensorData.homeBaseDistance;
  SensorDataDoc["wayPointBearing"] = sensorData.wayPointBearing;
  SensorDataDoc["wayPointDirection"] = sensorData.wayPointDirection;
  SensorDataDoc["compassHeading"] = sensorData.compassHeading;
  SensorDataDoc["compassDirection"] = sensorData.compassDirection;
  SensorDataDoc["nrOfSatellites"] = sensorData.nrOfSatellites;
}

// Saves the GPS data to a file
void saveGPSData(fs::FS &fs, const char * path, const SensorData &sensorData) {

  deleteFile(SPIFFS, path);
  Serial.println(path);
  File file = fs.open(path, FILE_WRITE);
  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }
  saveSensorDataToJSON();
  if (serializeJson(SensorDataDoc, file) == 0) {
    Serial.println(F("Failed to write to file"));
  }else{
    Serial.println(F("New file written"));
  }
  file.close();
}

void putJSONSensorDataInMemory() {
  String temp = SensorDataDoc["sensor"];
  temp.toCharArray(sensorData.sensorName, 8);  
  sensorData.gpsTime = SensorDataDoc["gpsTime"].as<int>();
  sensorData.ownLat = SensorDataDoc["ownLat"].as<float>(); 
  sensorData.ownLon = SensorDataDoc["ownLon"].as<float>();
  sensorData.homeBaseLat = SensorDataDoc["homeBaseLat"].as<float>();
  sensorData.homeBaseLon = SensorDataDoc["homeBaseLon"].as<float>();
  sensorData.homeBaseBearing = SensorDataDoc["homeBaseBearing"].as<float>();
  String temp1 = SensorDataDoc["homeBaseDirection"];
  temp1.toCharArray(sensorData.homeBaseDirection, 8);
  sensorData.homeBaseDistance = SensorDataDoc["homeBaseDistance"].as<float>();
  sensorData.wayPointBearing = SensorDataDoc["wayPointBearing"];
  String temp2 = SensorDataDoc["wayPointDirection"];
  temp2.toCharArray(sensorData.wayPointDirection, 8);
  sensorData.compassHeading = SensorDataDoc["compassHeading"].as<float>();
  String temp3 = SensorDataDoc["compassDirection"];
  temp3.toCharArray(sensorData.compassDirection, 8);  
  sensorData.nrOfSatellites = SensorDataDoc["nrOfSatellites"].as<int>();
}

// Loads the debug settings from a file
void IRAM_ATTR loadGPSData(fs::FS &fs, const char * path, SensorData &sensorData) {
  Serial.println(F("Loading debug settings..."));
  File file = fs.open(path, FILE_READ);
  delay(10);
  DeserializationError error = deserializeJson(SensorDataDoc, file);

  if (error){
    Serial.println(F("Failed to read file, using default debug settings."));
    Serial.println(error.c_str());
    saveGPSData(SPIFFS, path, sensorData);
  }else{
  putJSONSensorDataInMemory();
  file.close();
  }
}

String getGPSTimeMinsSecs(){
  if(!startup){
    while(!gps.time.isUpdated()){
      //Serial.println(".");
    }
  }
    if (gps.time.isUpdated()){
        hours = gps.time.hour() + config.timeZoneOffset;
        mins = gps.time.minute();
        secs = gps.time.second();
      if(hours<10){
        GPSTimeMinsSecs = "0" + String(hours);  
      }else{
         GPSTimeMinsSecs = String(hours);  
        }
      if(mins<10){
        GPSTimeMinsSecs = GPSTimeMinsSecs + ":" + "0" + String(mins);
      }else{
        GPSTimeMinsSecs = GPSTimeMinsSecs + ":" + String(mins);
        }
      if(secs<10){
        GPSTimeMinsSecs = GPSTimeMinsSecs + ":" + "0" + String(secs);      
      }else{
        GPSTimeMinsSecs = GPSTimeMinsSecs + ":" + String(secs);
        }
      }
      return GPSTimeMinsSecs;
}

String getGPSTimeMins(){
    if (gps.time.isUpdated()){
        hours = gps.time.hour() + config.timeZoneOffset;
        mins = gps.time.minute();
      if(hours<10){
        GPSTimeMins = "0" + String(hours);  
      }else{
         GPSTimeMins = String(hours);  
        }
      if(mins<10){
        GPSTimeMins = GPSTimeMins + ":" + "0" + String(mins);
      }else{
        GPSTimeMins = GPSTimeMins + ":" + String(mins);
        }
      }
      return GPSTimeMins;
}

