redd82/HaptiCap_V2_ESP32/src/main.cpp
String getGPSDate(){
  if(!startup){
    while(!gps.date.isUpdated()){
      //Serial.println(".");
    }
  }
      if (gps.date.isUpdated()){
        day = gps.date.day();
        month = gps.date.month();
        year = gps.date.year();
        GPSDate = String(year) + "-" + String(month) + "-" + String(day);
      }
      return GPSDate;
}

unsigned long distance2waypoint(float waypoint_latt, float waypoint_long){ 
    unsigned long distanceToWaypoint = (unsigned long)TinyGPSPlus::distanceBetween(gps.location.lat(),gps.location.lng(),waypoint_latt,waypoint_long);
    return distanceToWaypoint;
}

float coarse2waypoint(float waypoint_latt, float waypoint_long){
    float coarseToWaypoint = TinyGPSPlus::courseTo(gps.location.lat(),gps.location.lng(),waypoint_latt,waypoint_long);
    //const char *cardinalToWaypoint = TinyGPSPlus::cardinal(coarseToWaypoint);
    return coarseToWaypoint;
}

float CalcRelHeading(float compforheading,float coarseforWaypoint){
    float relativeHeading;
    if (coarseforWaypoint > compforheading){   
      relativeHeading = coarseforWaypoint - compforheading;
    }
    else{
      relativeHeading = 360.0 - compforheading + coarseforWaypoint;
    }
    return relativeHeading;
}

void updateGPSData(){
  if (millis() > 5000 && gps.charsProcessed() < 10){
      Serial.println(F("No GPS data received: check wiring"));
  } else {
      delay(10);
      SensorDataDoc["ownLat"] = gps.location.lat();
      SensorDataDoc["ownLon"] = gps.location.lng();
      SensorDataDoc["coarse2home"] = coarse2waypoint(SensorDataDoc["homeBaseLat"].as<float>(), SensorDataDoc["homeBaseLon"].as<float>());
      SensorDataDoc["distance2home"] = distance2waypoint(SensorDataDoc["homeBaseLat"].as<float>(), SensorDataDoc["homeBaseLon"].as<float>());
      SensorDataDoc["cardinal2home"] = TinyGPSPlus::cardinal(coarse2home);      
      SensorDataDoc["coarsewaypoint"] = coarse2waypoint(config.WAYPOINT_LAT, config.WAYPOINT_LON);
      SensorDataDoc["distancewaypoint"] = distance2waypoint(config.WAYPOINT_LAT, config.WAYPOINT_LON);      
      SensorDataDoc["relheading"] = CalcRelHeading(compassheading,coarsewaypoint);
      SensorDataDoc["relheading2home"] = CalcRelHeading(compassheading,coarse2home);
      SensorDataDoc["cardinalToWaypoint"] = TinyGPSPlus::cardinal(coarsewaypoint);
      //SensorDataDoc["compassCardinalHeading"] = TinyGPSPlus::cardinal(compassheading);
      SensorDataDoc["nrOfSattelites"] = gps.satellites.value();
  }


  if (nrsatt > 3){
        digitalWrite(led,HIGH);
  }else{
        digitalWrite(led,LOW);
  }

  if (fix.isUpdated())
    {
        GPSFix = atol(fix.value());         
    }
}

float GetCompassHeading(){
  //sensors_event_t event;
  //compass.getEvent(&event);
  float sum = 0.0;
  xyzFloat gValue = myMPU9250.getGValues();
  xyzFloat gyr = myMPU9250.getGyrValues();
  xyzFloat magValue = myMPU9250.getMagValues();
  float temp = myMPU9250.getTemperature();
  float resultantG = myMPU9250.getResultantG(gValue);
  previous_compassheading = compassheading;
  // Calculate heading
  float heading = atan2(magValue.y, magValue.x);
  //float heading = atan2(event.magnetic.y, event.magnetic.x);
  float declinationAngle = config.declAngleRad;
  heading += declinationAngle;
  
  // Correct for heading < 0deg and heading > 360deg
  if (heading < 0){
    heading += 2.0 * PI;
  }

  if (heading > 2.0 * PI){
    heading -= 2.0 * PI;
  }
  // Convert to degrees
  float headingDegrees = heading * 180.0/M_PI;
  headingraw = headingDegrees;

    if(config.compOffset >= 0){
      if(headingDegrees < config.compOffset){
        headingDegrees = headingDegrees - config.compOffset + 360.0;
      }else{
        headingDegrees = headingDegrees - config.compOffset;
      }
    }else{
        headingDegrees = headingDegrees + (-1.0 * config.compOffset);
        if(headingDegrees >= 360)
        {
            headingDegrees = headingDegrees - 360;
        }
    }
  //SensorDataDoc["compassCardinalHeading"] = TinyGPSPlus::cardinal(headingDegrees);
  SensorDataDoc["compassHeading"] = headingDegrees;
  return headingDegrees;
}

// Printline functions
static void printFloat(float val, bool valid, int len, int prec){
  if (!valid){
    while (len-- > 1)
      Serial.print('*');
    Serial.print(' ');
  }
  else{
    Serial.print(val, prec);
    int vi = abs((int)val);
    int flen = prec + (val < 0.0 ? 2 : 1); // . and -
    flen += vi >= 1000 ? 4 : vi >= 100 ? 3 : vi >= 10 ? 2 : 1;
    for (int i=flen; i<len; ++i)
      Serial.print(' ');
  }
  smartDelay(0);
}

static void printInt(unsigned long val, bool valid, int len){
  char sz[32] = "*****************";
  if (valid)
    sprintf(sz, "%ld", val);
  sz[len] = 0;
  for (int i=strlen(sz); i<len; ++i)
    sz[i] = ' ';
  if (len > 0) 
    sz[len-1] = ' ';
  Serial.print(sz);
  smartDelay(0);
}

static void printDateTime(TinyGPSDate &d, TinyGPSTime &t){
  if (!d.isValid()){
    Serial.print(F("********** "));
  }
  else{
    char sz[32];
    sprintf(sz, "%02d/%02d/%02d ", d.month(), d.day(), d.year());
    Serial.print(sz);
  }
  
  if (!t.isValid()){
    Serial.print(F("******** "));
  }
  else{
    char sz[32];
    sprintf(sz, "%02d:%02d:%02d ", t.hour(), t.minute(), t.second());
    Serial.print(sz);
  }
  printInt(d.age(), d.isValid(), 5);
  smartDelay(0);
}

static void printStr(const char *str, int len){
  int slen = strlen(str);
  for (int i=0; i<len; ++i)
    Serial.print(i<slen ? str[i] : ' ');
  smartDelay(0);
}

static void printLines(unsigned long distance2Waypoint, float course2Waypoint, float compheading,const char *cardinal2Waypoint,float relheading,float relheading2h){
  if(bPrintHeader){
  Serial.print("TinyGPS Library version: ");
  Serial.println(TinyGPSPlus::libraryVersion());
  Serial.println();
  Serial.println(F("Sats HDOP  Latitude   Longitude   Fix  Date       Time     Date Alt    Course Speed Card  Dist.   Course Card    Heading    Chars Sentences  Chksm   RelHDGWP  RelHDG2H   PWM      PWM      PWM     PWM     Touch0     Touch3  "));
  Serial.println(F("           (deg)      (deg)       Age                      Age  (m)    --- from GPS ----  --- to Waypoint ---  --Compass--  RX    RX         Fail     (deg)      (deg)    Front    Right    Rear    Left                       "));
  Serial.println(F("-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------"));
  }
  bPrintHeader = 0;
  printInt(gps.satellites.value(), gps.satellites.isValid(), 5);
  printFloat(gps.hdop.hdop(), gps.hdop.isValid(), 6, 1);
  printFloat(gps.location.lat(), gps.location.isValid(), 11, 6);
  printFloat(gps.location.lng(), gps.location.isValid(), 12, 6);
  printInt(gps.location.age(), gps.location.isValid(), 5);
  printDateTime(gps.date, gps.time);
  printFloat(gps.altitude.meters(), gps.altitude.isValid(), 7, 2);
  printFloat(gps.course.deg(), gps.course.isValid(), 7, 2);
  printFloat(gps.speed.kmph(), gps.speed.isValid(), 6, 2);
  printStr(gps.course.isValid() ? TinyGPSPlus::cardinal(gps.course.deg()) : "*** ", 7);
  printInt(distance2Waypoint, gps.location.isValid(), 9);
  printFloat(course2Waypoint, gps.location.isValid(), 7, 2);
  printStr(gps.location.isValid() ? cardinal2Waypoint : "*** ", 5);
  printFloat((compheading),true,7,2);
  printStr(true ? TinyGPSPlus::cardinal(compheading) : "*** ", 6);
  printInt(gps.charsProcessed(), true, 6);
  printInt(gps.sentencesWithFix(), true, 10);
  printInt(gps.failedChecksum(), true, 9);
  printFloat((relheading),true,11,2);
  printFloat((relheading2h),true,11,2);          
  printInt(pwm_front, true, 9);
  printInt(pwm_right, true, 9);
  printInt(pwm_rear, true, 9);
  printInt(pwm_left, true, 9);
  printInt(touchValueT0, true, 9);
  printInt(touchValueT3, true, 9);  
  Serial.println();  
}

void printConfigInMemory(){
  Serial.print("As Accesspoint: ");
  Serial.println(config.asAP);
  Serial.print("Client to SSID: ");
  Serial.println(config.clientSSID);
  Serial.print("Client Password: ");
  Serial.println(config.clientPasswd);
  Serial.print("Connection Timeout: ");
  Serial.println(config.connectionTimeOut);
  Serial.print("Devicename: ");
  Serial.println(config.deviceName);
  Serial.print("Device password: ");
  Serial.println(config.apPasswd);
  Serial.print("GPS polling(s): ");
  Serial.println(config.gpsPollSec);
  Serial.print("Target reached: ");
  Serial.println(config.targetReached);
  Serial.print("Compass polling(ms): ");
  Serial.println(config.compPollMs);
  Serial.print("Compass offset(deg): ");
  Serial.println(config.compOffset);
  Serial.print("Homebase(lat): ");
  Serial.println(config.HOME_LAT,6);
  Serial.print("Homebase(lon):" );
  Serial.println(config.HOME_LON,6);
  Serial.print("Waypoint(lat): ");
  Serial.println(config.WAYPOINT_LAT,6);
  Serial.print("Waypoint(lon):" );
  Serial.println(config.WAYPOINT_LON,6);  
  Serial.print("Declanation angle(rads): ");
  Serial.println(config.declAngleRad,12);
  Serial.print("Sleeptime(mins): ");
  Serial.println(config.sleepMins);
  Serial.print("Threshold touch: ");
  Serial.println(config.touchThreshold);
  Serial.print("Enable touch: ");
  Serial.println(config.touchEnabled);
  Serial.print("Timezone offset: ");
  Serial.println(config.timeZoneOffset);
  Serial.print("Pulsed max distance: ");
  Serial.println(config.maxDistance);
  Serial.print("Max Delay between pulses: ");
  Serial.println(config.maxDelay);

  Serial.print("FTP Enabled: ");
  Serial.println(config.ftpEnabled);  
  bDumpConfig = 0;
  Serial.println(); 
}

void printCalDataInMemory(){
  Serial.print("magBiasX: ");
  Serial.println(caldata.magBiasX,6);
  Serial.print("magBiasY: ");
  Serial.println(caldata.magBiasY,6);
  Serial.print("magBiasZ: ");
  Serial.println(caldata.magBiasZ,6);
  Serial.print("magScaleFacX: ");
  Serial.println(caldata.magScaleFacX,6);
  Serial.print("magScaleFacY: ");
  Serial.println(caldata.magScaleFacY,6);
  Serial.print("magScaleFacZ: ");
  Serial.println(caldata.magScaleFacZ,6);
  Serial.print("gyroBiasX: ");
  Serial.println(caldata.gyroBiasX,6);
  Serial.print("gyroBiasY: ");
  Serial.println(caldata.gyroBiasY,6);
  Serial.print("gyroBiasZ: ");
  Serial.println(caldata.gyroBiasZ,6);
  Serial.print("accelBiasX: ");
  Serial.println(caldata.accelBiasX,6);
  Serial.print("accelBiasY: ");
  Serial.println(caldata.accelBiasY,6);
  Serial.print("accelBiasZ:" );
  Serial.println(caldata.accelBiasZ,6);
  Serial.print("accelScaleX: ");
  Serial.println(caldata.accelScaleX,6);
  Serial.print("accelScaleY:" );
  Serial.println(caldata.accelScaleY,6);  
  Serial.print("accelScaleZ: ");
  Serial.println(caldata.accelScaleZ,6);
  bDumpConfig = 0;
  Serial.println(); 
}

void printDebugSettingsInMemory(){
  Serial.print("Debug2Serial: ");
  Serial.println(debugSettings.debug2Serial);  
  Serial.print("Debug RAW GPS to telnet: ");
  Serial.println(debugSettings.debugData2Serial);
  Serial.print("Haptic feedback Debug: ");
  Serial.println(debugSettings.debugHaptic);
}

void webServerSetup(){
// Webserver setup responses
  webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      if(!config.ftpEnabled){
      request->send(SPIFFS, "/index.html", String(), false, processor);
      timerRestart(timer2);
      if(debugSettings.debug2Serial){
        Serial.println("index called");
      }
      } else{
        request->send(SPIFFS, "/ftpmode.html", String(), false, processor);
      }

