redd82/HaptiCap_V2_ESP32/src/main.cpp
    }
  );

    webServer.on("/restart", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      saveConfiguration(SPIFFS, filename, config);
      esp_restart();
    }
  );

  webServer.onRequestBody(
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
        {
            if ((request->url() == "/settings/settings_form") && (request->method() == HTTP_POST))
            {
                if (DeserializationError::Ok == deserializeJson(configDoc, (const char*)data))
                {
                    JsonObject obj = configDoc.as<JsonObject>();
                    putJSONConfigDataInMemory();
                    saveConfiguration(SPIFFS, filename, config);
                    printConfigInMemory();
                    if(config.asAP){
                      delay(1000);
                      esp_restart();
                    }
                }
                request->send(200, "application/json", "{ \"status\": 0 }");
            } else if ((request->url() == "/settings/calibration_form") && (request->method() == HTTP_POST))
            {
                if (DeserializationError::Ok == deserializeJson(calDataDoc, (const char*)data))
                {
                    JsonObject obj = calDataDoc.as<JsonObject>();
                    putJSONCalibrationDataInMemory();
                    saveCalibrationData(SPIFFS, filename_cal, caldata);
                }
                request->send(200, "application/json", "{ \"status\": 0 }");
            } else if ((request->url() == "/settings/debug_form") && (request->method() == HTTP_POST))
            {
                if (DeserializationError::Ok == deserializeJson(debugSettingsDoc, (const char*)data))
                {
                    JsonObject obj = debugSettingsDoc.as<JsonObject>();
                    putJSONDebugSettingsInMemory();
                    saveDebugSettings(SPIFFS, filename_debug, debugSettings);
                }
                request->send(200, "application/json", "{ \"status\": 0 }");
            }
        }
    );

  webServer.on(fileCss.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, fileCss.c_str(), "text/css");
    }
  );

  webServer.on(fileCssMap.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, fileCssMap.c_str(), "text/css");
    }
  );

  webServer.on(fileJs.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, fileJs.c_str(), "application/javascript");
      //request->send(SPIFFS, fileJs.c_str(), String(), false, processor);
    }
  );

  webServer.on(fileJsMap.c_str(), HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, fileJsMap.c_str(), "application/javascript");
      //request->send(SPIFFS, fileJsMap.c_str(), String(), false, processor);
    }
  );

  webServer.on("/getGPSTime", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      String temp = getGPSTimeMins();
      request->send(200, "application/json", "{ \"GPSTime\" : \"" + temp + "\" }");
    }
  );

  webServer.on("/getGPSDate", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      String temp = getGPSDate();
      request->send(200, "application/json", "{ \"GPSDate\" : \"" + temp + "\" }");
    }
  );

  webServer.on("/getGPSData", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      //      serializeJson(GPSDataDoc, Serial);
      String temp;
      serializeJson(SensorDataDoc, temp);
      request->send(200, "application/json", temp );
    }
  );

  webServer.on("/setHome", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      // request->send(200, "application/json", temp );
      SensorDataDoc["homeBaseLat"] = gps.location.lat();
      SensorDataDoc["homeBaseLon"] = gps.location.lng();
      request->send(200, "application/json", "{ \"status\": 0 }");
    }
  );


  webServer.on("/hapticap.json", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/hapticap.json", "application/json");
    }
  );

  webServer.on("/caldata.json", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/caldata.json", "application/json");
    }
  );

    webServer.on("/debug.json", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/debug.json", "application/json");
    }
  );

  webServer.on("/getConfigToSerial", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      printConfigInMemory();
      request->send(200, "application/json", "{ \"status\": 0 }");
    }
  );

  webServer.on("/map1.jpg", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/map1.jpg", "image/jpeg");
    }
  );

  webServer.on("/manifest.json", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/manifest.json", "application/json");  
    }
  );

    webServer.on("/favicon.ico", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/favicon.ico", "image/ico");  
    }
  );

    webServer.on("/logo192.png", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      request->send(SPIFFS, "/logo192.png", "image/png");  
    }
  );

  webServer.onNotFound( []( AsyncWebServerRequest * request )
     {
      request->send(SPIFFS, "/redirect.html", String(), false, processor);
      timerRestart(timer2);
      Serial.println("redirect called");
    });
  
 
  webServer.begin();
  Serial.print("HTTP Started on port: ");
  Serial.println(config.http_port);
}

void webServerSetupFTP(){
  // Webserver setup responses
  webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      if(!config.ftpEnabled){
      request->send(SPIFFS, "/index.html", String(), false, processor);
      timerRestart(timer2);
      if(debugSettings.debug2Serial){
        Serial.println("index called");
      }
      } else{
        request->send(SPIFFS, "/ftpmode.html", String(), false, processor);
      }
    }
  );

    webServer.on("/restart", HTTP_GET, [](AsyncWebServerRequest *request)
    {
      saveConfiguration(SPIFFS, filename, config);
      delay(1000);
      esp_restart();
    }
  );
  webServer.begin();
  Serial.print("HTTP Started on port: ");
  Serial.println(config.http_port);
}

void getInitialReadings(){
   sensorData.compassHeading = GetCompassHeading();
   //compassCardinalHeading = TinyGPSPlus::cardinal(sensorData.compassHeading);
   previous_compassheading = sensorData.compassHeading;
  // coarsewaypoint = coarse2waypoint(config.WAYPOINT_LAT, config.WAYPOINT_LON);
  // distancewaypoint = distance2waypoint(config.WAYPOINT_LAT, config.WAYPOINT_LON);
   relheading = CalcRelHeading(sensorData.compassHeading,coarsewaypoint);
  cardinalToWaypoint = TinyGPSPlus::cardinal(coarsewaypoint);
  coarse2home = coarse2waypoint(SensorDataDoc["homeBaseLat"].as<float>(), SensorDataDoc["homeBaseLon"].as<float>());
  distance2home = distance2waypoint(SensorDataDoc["homeBaseLat"].as<float>(), SensorDataDoc["homeBaseLon"].as<float>());
  cardinal2home = TinyGPSPlus::cardinal(coarse2home);
  flCurrentLat = gps.location.lat();
  flCurrentLon = gps.location.lng();
  nrsatt = gps.satellites.value();
}

