redd82/HaptiCap_V2_ESP32/src/main.cpp
void setup(){
  // Serial port for debugging purposes
  Serial.begin(SerialUSBBaud);
  Serial2.begin(GPSBaud);
  delay(1000);

  // Initialize SPIFFS
  if(!SPIFFS.begin(true)){
      while (1)
        Serial.println("SPIFFS.begin() failed");
  } else {
     listDir(SPIFFS, "/", 0);
  }

  Serial.println();
  delay(1000);
  loadConfiguration(SPIFFS, filename, config);
  loadDebugSettings(SPIFFS, filename_debug, debugSettings);  
  
  Serial.println();
  Serial.print("HaptiCap version: ");
  Serial.println(SWVERSION);
  Serial.println("By Chrysnet.com and Triznet.com");

//Setup interrupt on Touch Pad 1 (GPIO0) and wake up
  touchAttachInterrupt(T0, callbackT0, config.touchThreshold);
  touchAttachInterrupt(T3, callbackT3, config.touchThreshold);
  esp_sleep_enable_touchpad_wakeup();
  
// Initialize outputs
  pinMode(buttonPin,INPUT);
  pinMode(led, OUTPUT);
  pinMode(dta_rdy_pin,INPUT);

// timer0 setup
  timer0 = timerBegin(0, 80, true);
  timerAttachInterrupt(timer0, &onTimer0, true);
  timerAlarmWrite(timer0, (config.gpsPollSec * 1000000), true);           // 1000 ms
// timer1 setup
  timer1 = timerBegin(1, 80, true);
  timerAttachInterrupt(timer1, &onTimer1, true);
  timerAlarmWrite(timer1, (config.compPollMs * 1000), true);            // 1 ms
// timer2 setup
  timer2 = timerBegin(2, 80, true);
  timerAttachInterrupt(timer2, &onTimer2, true);
  timerAlarmWrite(timer2, (config.sleepMins * 60000000), true);            // 1 min
  
//PWM setup
  ledcSetup(pwmhapticfront, hapticfreq, resolution);
  ledcSetup(pwmhapticright, hapticfreq, resolution);
  ledcSetup(pwmhapticrear, hapticfreq, resolution);
  ledcSetup(pwmhapticleft, hapticfreq, resolution);
  ledcAttachPin(hapticfront, pwmhapticfront);
  ledcAttachPin(hapticright, pwmhapticright);
  ledcAttachPin(hapticrear, pwmhapticrear);
  ledcAttachPin(hapticleft, pwmhapticleft);
  digitalWrite(led, 0);

  delay(500);
  // Connect to Wi-Fi network with SSID and password
  if (config.asAP) {
      delay(1000);
      WiFi.mode( WIFI_MODE_APSTA );
      IPAddress ip( 192, 168, 1, 1 );
      IPAddress gateway( 192, 168, 1, 1 );
      IPAddress subnet( 255, 255, 255, 0 );
      WiFi.softAP(config.deviceName,config.apPasswd);
      delay(2000);
      WiFi.softAPConfig( ip, gateway, subnet );
      Serial.print("Setting HaptiCap up as AP: ");
      Serial.println(config.deviceName);
      Serial.println(config.apPasswd);      
      IPAddress IP = WiFi.softAPIP();
      Serial.print("AP IP address: ");
      Serial.println(IP);
  }else{
      Serial.print("Setting HapiCap as client to network ");
      Serial.print(config.clientSSID);
      WiFi.mode(WIFI_STA);
      WiFi.begin(config.clientSSID, config.clientPasswd);
      intCounterWifi = 0;
      
    while (WiFi.status() != WL_CONNECTED){
      delay(500);
      Serial.print(".");
      intCounterWifi++;
        if (intCounterWifi > 120){
          config.asAP = 1;
          saveConfiguration(SPIFFS, filename, config);
          delay(1000);
          ESP.restart();          
        }
      }

  // initialize WiFi
    Serial.println("");
    Serial.print("Connected to ");
    Serial.println(config.clientSSID);
    IPAddress IP = WiFi.localIP();
    ipAddress = IP.toString();
    hostAddress = "http://" + ipAddress;
  }
 
  Serial.println("");
  byte whoAmICode = 0x00;
  Wire.begin();
  if(!myMPU9250.init()){
    Serial.println("MPU9250 does not respond");
  }
  else{
    Serial.println("MPU9250 is connected");
  }

  if(!myMPU9250.initMagnetometer()){
    Serial.println("Magnetometer does not respond");
  }
  else{
    Serial.println("Magnetometer is connected");
  }

  delay(1000);
  myMPU9250.autoOffsets();
  myMPU9250.enableGyrDLPF();
  myMPU9250.setGyrDLPF(MPU9250_DLPF_6);  // lowest noise
  myMPU9250.setSampleRateDivider(5);
  myMPU9250.setGyrRange(MPU9250_GYRO_RANGE_250);
  myMPU9250.setAccRange(MPU9250_ACC_RANGE_2G);
  myMPU9250.enableAccDLPF(true);
  myMPU9250.setAccDLPF(MPU9250_DLPF_6);
  myMPU9250.setMagOpMode(AK8963_CONT_MODE_100HZ);
  
  // Start server
  if (SPIFFS.begin(true)) {

  }

  while (Serial2.available()){
    gps.encode(Serial2.read());  
  }

loadCalibrationData(SPIFFS, filename_cal, caldata);
delay(1000);
getInitialReadings();
timerAlarmEnable(timer0);
timerAlarmEnable(timer1);
timerAlarmEnable(timer2);

if(!config.asAP){
  Serial.print("IP address: ");
  Serial.println(ipAddress);
  Serial.print("Host address: ");
  Serial.println(hostAddress);
  }else{
    dnsServer.start(config.dns_port, "*", WiFi.softAPIP());
    Serial.print("DNS Started on port.");
    Serial.println(config.dns_port);
  }

  if(config.ftpEnabled){
    Serial.println("FTP started.");
    //webServerSetupFTP();
    config.ftpEnabled = false;
    saveConfiguration(SPIFFS, filename, config);
    delay(1000);
    config.ftpEnabled = true;
    ftpSrv.begin(config.deviceName,config.apPasswd);
  }else{
    webServerSetup();
  }

delay(1000);
Serial.print("HaptiCap ready @ ");
GPSTimeMinsSecs = getGPSTimeMinsSecs();
GPSDate = getGPSDate();
Serial.println(GPSTimeMinsSecs + " " + GPSDate);
Serial.println();
startup = true;
}
 
void loop(){
  if(config.ftpEnabled){
     ftpSrv.handleFTP();
  } else {
    if(config.asAP){  
      dnsServer.processNextRequest();
    }

  // Start of main code.
    if(timers_disabled){
      timers_disabled = 0; 
      timerStart(timer0);
      timerStart(timer1);
      timerStart(timer2);                
    }

    if(interrupt0 > 0){
      portENTER_CRITICAL(&timer0Mux);
      interrupt0--;    
      portEXIT_CRITICAL(&timer0Mux);
        while (Serial2.available()){
          gps.encode(Serial2.read());
        }
        if (debugSettings.debug2Serial){
          Serial.println("Position updated.");
        }
      }
      updateGPSData();

      if(interrupt1 > 0){
        portENTER_CRITICAL(&timer1Mux);
        interrupt1--;      
        portEXIT_CRITICAL(&timer1Mux);
        sensorData.compassHeading = GetCompassHeading();
        if(interrupt1 > 10){
          interrupt1 = 2;
        }
        if (debugSettings.debug2Serial){
          Serial.print("Heading updated: ");
          Serial.println(sensorData.compassHeading);
        }                  
      }
  }
}